list01 = [
    [1, 2, 3, 4],
    [5, 6, 7, 8],
    [9, 10, 11, 12],
    [13, 14, 15, 16]
]


# list02 = [
#     [1, 5, 9, 13],
#     [2, 6, 10, 14],
#     [3, 7, 11, 15],
#     [4, 8, 12, 16]
# ]

# 5 <----->  2
#list01[1][0]=list01[0][1]

# 9 <----->  3
#list01[2][0]=list01[0][2]
#list01[3][0]=list01[0][3]

#list01[2][1]=list01[1][2]
#list01[3][1]=list01[1][3]

#list01[3][2]=list01[2][3]

# 先確定外內層循環的範圍
for c in range(1, 4):  # 1 2 3
    for r in range(c, 4):
        # 值交換
        # list01[r][c-1] = list01[c-1][r]
        list01[r][c-1], list01[c-1][r] = list01[c-1][r], list01[r][c-1]


print(list01)
